# -*- coding: utf-8 -*-
"""
Created on Thu Nov 30 14:58:46 2017

@author: rd0348
"""

# 数学知识
# 标准差[均方差] 
# 定义如下:
# 标准差（Standard Deviation），在概率统计中最常使用作为统计分布程度（statistical dispersion）上的测量。
# 标准差定义是总体各单位标准值与其平均数离差平方的算术平均数的平方根。它反映组内个体间的离散程度!
# 简而言之 : 标准差是一组数据平均值分散程度的一种度量。一个较大的标准差，代表大部分数值和其平均值之间差异较大；一个较小的标准差，代表这些数值较接近平均值.
# 标准差越大,分散程度越大,反之,越集中.
# 详细可以参考 : https://baike.baidu.com/item/%E6%A0%87%E5%87%86%E5%B7%AE/1415772?fr=aladdin

# 方差
# 方差描述随机变量对于数学期望的偏离程度
# 在概率论和统计方差衡量随机变量或一组数据时离散程度的度量。概率论中方差用来度量随机变量和其数学期望（即均值）之间的偏离程度
# 统计中的方差（样本方差）是每个样本值与全体样本值的平均数之差的平方值的平均数
# 1．两点分布
# 2．二项分布 X ~ B ( n, p )
# 引入随机变量Xi （第i次试验中A 出现的次数，服从两点分布），
# 3．泊松分布（推导略）
# 4．均匀分布 另一计算过程为
# 5．指数分布（推导略）
# 6．正态分布（推导略）
# 7.t分布：其中X~T（n），E（X）=0； 
# 8.F分布：其中X~F（m,n）, 
# 简而言之 : 方差越小就越稳定,越集中
#详细可以参考 : https://baike.baidu.com/item/%E6%96%B9%E5%B7%AE/3108412?fr=aladdin
# http://www.cnblogs.com/flywithyou/p/4058832.html 
# 协方差
# 协方差分析是建立在方差分析和回归分析基础之上的一种统计分析方法。 
# 方差分析是从质量因子的角度探讨因素不同水平对实验指标影响的差异。
# 一般说来，质量因子是可以人为控制的。 回归分析是从数量因子的角度出发，
# 通过建立回归方程来研究实验指标与一个（或几个）因子之间的数量关系
# 方差是协方差的一种特殊情况，即当两个变量是相同的情况
# https://www.cnblogs.com/flywithyou/p/4059003.html
# http://www.baike.com/wiki/%E5%8D%8F%E6%96%B9%E5%B7%AE













